{
  "decks": [
    {
      "id": 1,
      "name": "Rendering in React",
      "description": "React's component structure allows for quickly building a complex web application that relies on DOM manipulation. "
    },
    {
      "name": "React Router",
      "description": "React Router is a collection of navigational components that compose declaratively with your application.",
      "id": 2
    },
    {
      "name": "RuPaul's Drag Race",
      "description": "All the gags, shade, and high-heeled eleganza you can handle, henny",
      "id": 3
    }
  ],
  "cards": [
    {
      "id": 1,
      "front": "Differentiate between Real DOM and Virtual DOM.",
      "back": "Virtual DOM updates are faster but do not directly update the HTML",
      "deckId": 1
    },
    {
      "id": 2,
      "front": "How do you modify the state of a different React component?",
      "back": "Not at all! State is visible to the component only.",
      "deckId": 1
    },
    {
      "id": 3,
      "front": "How do you pass data 'down' to a React child component?",
      "back": "As properties or props",
      "deckId": 1
    },
    {
      "front": "What path will match the follow Route?\n<Route>\n  <NotFound />\n</Route>",
      "back": "All paths. A route with no path matches all URL's",
      "deckId": 2,
      "id": 4
    },
    {
      "front": "What does <Switch> do?",
      "back": "Renders the first matching child <Route> ",
      "deckId": 2,
      "id": 5
    },
    {
      "front": "What method is used in React to change the state of a component",
      "back": "In React, the setState() method is employed to modify the state of a component, triggering re-rendering when the state changes",
      "deckId": 1,
      "id": 7
    },
    {
      "front": "Which season of RuPaul's Drag Race introduced the \"Snatch Game\" challenge?",
      "back": "The \"Snatch Game\" challenge was introduced in Season 2 and has since become a beloved fan favorite.\n\n",
      "deckId": 3,
      "id": 8
    },
    {
      "front": "What is the signature phrase RuPaul uses to introduce the runway segment of the show?",
      "back": "\"Category is...\" ",
      "deckId": 3,
      "id": 9
    },
    {
      "front": "Which contestant holds the record for the most challenge wins in a single season of RuPaul's Drag Race?",
      "back": "Shea Couleé holds the record for the most challenge wins in a single season, with a total of four wins in Season 5 of All Stars.",
      "deckId": 3,
      "id": 10
    }
  ]
}
